 ### Terraform Component 🧱: `aws-analytical-platform-development-cluster`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Static Analysis 🛂

Checkov: `failure`

tfsec: `failure`

#### Terraform Plan 📖: `success`

<details><summary>Plan Output</summary>

```

module.rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=2Ow_Nw]
random_string.suffix: Refreshing state... [id=aWrhyc0m]
data.aws_caller_identity.session: Reading...
data.aws_caller_identity.session: Read complete after 0s [id=042130406152]
data.aws_iam_session_context.session: Reading...
data.aws_iam_session_context.session: Read complete after 0s [id=arn:aws:sts::042130406152:assumed-role/GlobalGitHubActionAccess/GitHubActions]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.control_panel_redis.aws_elasticache_parameter_group.default[0]: Refreshing state... [id=control-panel-development]
module.iam_assumable_role_external_secrets.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.superset: Reading...
data.aws_secretsmanager_secret_version.auth0_credentials: Reading...
module.rds.module.db_instance.data.aws_partition.current: Reading...
module.iam_assumable_role_jupyterhub_teama.data.aws_caller_identity.current: Reading...
module.eks.module.fargate.data.aws_partition.current: Reading...
module.iam_assumable_role_control_panel_api.data.aws_caller_identity.current: Reading...
module.eks.module.fargate.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
data.aws_iam_policy_document.superset: Read complete after 0s [id=1516425134]
module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_superset.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.efs_csi_driver: Reading...
module.iam_assumable_role_prometheus_remote_ingest.data.aws_partition.current: Reading...
module.iam_assumable_role_prometheus_remote_ingest.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.efs_csi_driver: Read complete after 0s [id=3577890971]
module.eks.data.aws_iam_policy_document.cluster_deny_log_group[0]: Reading...
data.aws_iam_policy_document.ebs_csi_driver: Reading...
data.aws_iam_policy_document.ebs_csi_driver: Read complete after 0s [id=2923734509]
module.eks.data.aws_iam_policy_document.cluster_deny_log_group[0]: Read complete after 0s [id=2940822895]
module.iam_assumable_role_jupyterhub_teama.data.aws_partition.current: Reading...
module.iam_assumable_role_jupyterhub_teama.data.aws_partition.current: Read complete after 0s [id=aws]
aws_sns_topic.analytical_platform_compute_alerts: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-compute-alerts20230518155829593800000003]
module.iam_assumable_role_jupyterhub_teama.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.iam_assumable_role_superset.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.iam_assumable_role_control_panel_api.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.iam_assumable_role_external_secrets.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.iam_assumable_role_external_dns.data.aws_caller_identity.current: Reading...
aws_sns_topic.analytical_platform_storage_alerts: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-storage-alerts20230518155829598600000005]
aws_kms_key.eks: Refreshing state... [id=0e00c57e-76d7-4c5e-830b-54087a7e9b58]
module.iam_assumable_role_external_dns.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.iam_assumable_role_ebs_csi_driver.data.aws_partition.current: Reading...
module.iam_assumable_role_ebs_csi_driver.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_cluster_autoscaler.data.aws_caller_identity.current: Reading...
aws_efs_file_system.eks_user_homes: Refreshing state... [id=fs-0dbd6739]
module.iam_assumable_role_cluster_autoscaler.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.iam_assumable_role_ebs_csi_driver.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Read complete after 0s [id=2764486067]
data.aws_iam_policy_document.external_secrets: Reading...
data.aws_iam_policy_document.external_secrets: Read complete after 0s [id=4056634892]
module.eks.data.aws_caller_identity.current: Reading...
data.aws_secretsmanager_secret_version.control_panel_rds_db_password: Reading...
module.iam_assumable_role_ebs_csi_driver.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_prometheus_remote_ingest.data.aws_caller_identity.current: Reading...
module.iam_assumable_role_superset.data.aws_partition.current: Reading...
module.iam_assumable_role_superset.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_prometheus_remote_ingest.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_iam_policy_document.prometheus_remote_ingest: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.prometheus_remote_ingest: Read complete after 0s [id=2793503294]
module.iam_assumable_role_external_dns.data.aws_partition.current: Reading...
module.iam_assumable_role_external_dns.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20230126110644413300000002]
data.aws_secretsmanager_secret_version.auth0_credentials: Read complete after 0s [id=development/auth0-terraform/auth0-creds|AWSCURRENT]
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=eks-development-control-panel-psg-db-encrypted-20230206092654575300000001]
module.iam_assumable_role_external_secrets.data.aws_partition.current: Reading...
module.iam_assumable_role_external_secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_cluster_autoscaler.data.aws_partition.current: Reading...
module.iam_assumable_role_cluster_autoscaler.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_assumable_role_control_panel_api.data.aws_partition.current: Reading...
module.iam_assumable_role_control_panel_api.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_policy.superset: Refreshing state... [id=arn:aws:iam::525294151996:policy/superset20210514153428141100000001]
data.aws_secretsmanager_secret_version.control_panel_rds_db_password: Read complete after 0s [id=development/control-panel-db-password|AWSCURRENT]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/development-aWrhyc0m/cluster]
aws_sns_topic.control_panel_alerts: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:control-panel-alerts20230518155934196600000008]
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Reading...
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Read complete after 0s [id=2829572932]
data.aws_route53_zone.main: Reading...
module.iam_assumable_role_cert_manager.data.aws_partition.current: Reading...
module.iam_assumable_role_cert_manager.data.aws_partition.current: Read complete after 0s [id=aws]
aws_sns_topic.analytical_platform_networking_alerts: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-networking-alerts20230518155829603400000006]
data.aws_iam_policy_document.prometheus_central_ingest: Reading...
data.aws_iam_policy_document.prometheus_central_ingest: Read complete after 0s [id=3967579200]
data.aws_iam_policy_document.rds_enhanced_monitoring: Reading...
data.aws_iam_policy_document.rds_enhanced_monitoring: Read complete after 0s [id=76086537]
data.aws_secretsmanager_secret_version.control_panel_redis: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
data.aws_iam_policy_document.jupyterhub_teama: Reading...
data.aws_iam_policy_document.jupyterhub_teama: Read complete after 0s [id=213850758]
module.iam_assumable_role_cert_manager.data.aws_caller_identity.current: Reading...
data.aws_iam_roles.aws_sso_administrator_access: Reading...
module.iam_assumable_role_cert_manager.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-007e49b135f4129e5]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
data.aws_iam_policy_document.efs_csi_driver_assume: Reading...
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/development-aWrhyc0m-deny-log-group20230424182540079500000001]
data.aws_iam_policy_document.efs_csi_driver_assume: Read complete after 0s [id=2979095732]
data.aws_iam_roles.aws_sso_administrator_access: Read complete after 0s [id=eu-west-1]
data.aws_iam_policy_document.control_panel_api: Reading...
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002]
data.aws_secretsmanager_secret_version.control_panel_redis: Read complete after 0s [id=development/control-panel-redis|AWSCURRENT]
data.aws_iam_policy_document.control_panel_api: Read complete after 0s [id=76428581]
aws_iam_policy.prometheus_remote_ingest: Refreshing state... [id=arn:aws:iam::525294151996:policy/prometheus_remote_ingest]
module.rds.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=ControlPanelRDSMonitoringRole-psgdb-encrypted]
aws_cloudwatch_metric_alarm.rds_low_cpu_credit_balance: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-low-cpu-credit-balance]
aws_cloudwatch_metric_alarm.rds_high_disk_queue_depth: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-high-disk-queue-depth]
aws_cloudwatch_metric_alarm.rds_low_freeable_memory: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-low-freeable-memory]
aws_cloudwatch_metric_alarm.rds_high_swap_usage: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-high-swap-usage]
aws_cloudwatch_metric_alarm.rds_low_disk_burst_balance: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-low-disk-burst-balance]
aws_cloudwatch_metric_alarm.rds_low_free_storage_space: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-low-free-storage-space]
data.aws_route53_zone.main: Read complete after 0s [id=ZN5W55EJLVJY9]
aws_cloudwatch_metric_alarm.rds_anamalous_connection_count: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-anamalous-connection-count]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/development-aWrhyc0m-elb-sl-role-creation20211205093757214200000001]
aws_cloudwatch_metric_alarm.rds_high_cpu_utilisation: Refreshing state... [id=rds-eks-development-control-panel-psg-db-encrypted-high-cpu-utilisation]
aws_iam_role.prometheus_central_ingest: Refreshing state... [id=prometheus_central_ingest]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/vpc-flow-log-to-cloudwatch-20230126110644412400000001]
aws_iam_role.rds_enhanced_monitoring: Refreshing state... [id=rds-enhanced-monitoring-20220518102138459500000001]
aws_iam_policy.jupyterhub_teama: Refreshing state... [id=arn:aws:iam::525294151996:policy/jupyterhub-teama]
aws_cloudwatch_metric_alarm.efs_low_credit_burst_balance: Refreshing state... [id=efs-low-credit-burst-balance]
aws_efs_access_point.eks_user_homes: Refreshing state... [id=fsap-0ee596375d803261f]
aws_iam_role.efs_csi_driver: Refreshing state... [id=AmazonEKSEFSCSIDriverRole20210527141128820800000001]
aws_iam_policy.control_panel_api: Refreshing state... [id=arn:aws:iam::525294151996:policy/dev_eks_control_panel_api]
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Read complete after 0s [id=3778018924]
module.iam_assumable_role_superset.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_superset.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=444828289]
module.rds.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=ControlPanelRDSMonitoringRole-psgdb-encrypted-20230117160351650900000002]
module.karpenter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20230126110644413300000002-20230126110645864300000003]
data.aws_iam_policy_document.cert_manager: Reading...
data.aws_iam_policy_document.external_dns: Reading...
module.karpenter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2560088296]
aws_iam_role_policy_attachment.prometheus_central_ingest: Refreshing state... [id=prometheus_central_ingest-20210616131827751500000001]
data.aws_iam_policy_document.cert_manager: Read complete after 0s [id=3326573489]
data.aws_iam_policy_document.external_dns: Read complete after 0s [id=2724900144]
aws_iam_role_policy_attachment.rds_enhanced_monitoring: Refreshing state... [id=rds-enhanced-monitoring-20220518102138459500000001-20220518102139883700000002]
module.iam_assumable_role_superset.aws_iam_role.this[0]: Refreshing state... [id=superset20230414140152290300000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002-20211205093758903500000007]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002-20211205093758879300000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002-20211205093758866900000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002-20211205093758873900000005]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=development-aWrhyc0m20211205093757214400000002-20230424182541125800000003]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0a33943aa1d5c606a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-075e18b11a6dd09cb]
auth0_client.rstudio: Refreshing state... [id=UgxjvAPi6hUjKd4RTIF95boLmbywzpbK]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-047260fee89f6935c]
auth0_client.airflow_sqlite: Refreshing state... [id=QweDY7kFsM4MkvXJ4ELoQFpkp2wz4B2f]
auth0_client.jupyter_lab: Refreshing state... [id=iqb4GXa17Mnrc86UYAgYkS9g1boUsYOo]
auth0_client.controlpanel: Refreshing state... [id=8EK6zPeEkYP0LFJwFHhd8wUbJN5KiUUL]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-09ccf0d79ef258873]
aws_security_group.efs: Refreshing state... [id=sg-01fc272e6ad72decd]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e3c3e851f1aeb25a]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d85cf3a4a3f262d2]
aws_security_group.controlplane: Refreshing state... [id=sg-08e5fbe3c4f8cb567]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0ed102bf52e23a248]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-098d60cc0923abe8c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d49afdc0c49bba9b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01855512f559b0270]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-066c4a7efa57dc384]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-081df3de344c2299d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-035ac231c2f6bf980]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08b67b505fd14404e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06f56bb855f47b0dc]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05dd7f1fb8b46ab1b]
data.aws_nat_gateways.nat_gateways: Reading...
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b8882510494b78f1]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-05a14908e75ffe666]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0edccc56eb8bf4edc]
module.iam_assumable_role_superset.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=superset20230414140152290300000001-20230414140159301000000002]
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_networking_cloudwatch_integration_key: Reading...
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_storage_cloudwatch_integration_key: Reading...
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_compute_cloudwatch_integration_key: Reading...
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-007e49b135f4129e5]
data.aws_nat_gateways.nat_gateways: Read complete after 0s [id=eu-west-1]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=development-vpc]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0e3a032e1b4d2d3ef]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-089bd9a5bb67ed06c]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-01522f48fdc870e18]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02a4a053ce35efdf3]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01dab9beae003a14e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-054e2453076e90b9a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b78921e3e25bbe44]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0097886b7a781039a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07120adea3303c36c]
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_networking_cloudwatch_integration_key: Read complete after 1s [id=pagerduty/analytical-platform-networking/integration-keys/cloudwatch|AWSCURRENT]
aws_cloudwatch_metric_alarm.nat_gateway_bandwidth["nat-027026b1d29d193db"]: Refreshing state... [id=nat-gateway-nat-027026b1d29d193db-high-bandwidth]
aws_cloudwatch_metric_alarm.nat_gateway_bandwidth["nat-070560316a18042a1"]: Refreshing state... [id=nat-gateway-nat-070560316a18042a1-high-bandwidth]
aws_cloudwatch_metric_alarm.nat_gateway_bandwidth["nat-0eeacde33bf9d429d"]: Refreshing state... [id=nat-gateway-nat-0eeacde33bf9d429d-high-bandwidth]
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_compute_cloudwatch_integration_key: Read complete after 1s [id=pagerduty/analytical-platform-compute/integration-keys/cloudwatch|AWSCURRENT]
data.aws_secretsmanager_secret_version.pagerduty_analytical_platform_storage_cloudwatch_integration_key: Read complete after 1s [id=pagerduty/analytical-platform-storage/integration-keys/cloudwatch|AWSCURRENT]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b6ebc74c03f3c00f]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0969ab611cbf54cd3]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b81b7ed2c8c8f32c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-035ac231c2f6bf9801080289494]
aws_efs_mount_target.eks_user_homes[0]: Refreshing state... [id=fsmt-4c1bcb79]
aws_efs_mount_target.eks_user_homes[1]: Refreshing state... [id=fsmt-4f1bcb7a]
aws_efs_mount_target.eks_user_homes[2]: Refreshing state... [id=fsmt-4d1bcb78]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-2828479309]
module.control_panel_redis.aws_elasticache_subnet_group.default[0]: Refreshing state... [id=control-panel-development]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-4173929422]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-697216376]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-1841701928]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1717954365]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1308511911]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-08ca94ca8107cfea7]
module.rds.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=eks-development-control-panel-psg-db-encrypted-20230106124521624600000001]
aws_sns_topic_subscription.analytical_platform_networking_alerts_pagerduty: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-networking-alerts20230518155829603400000006:798fc479-7e44-400c-b7bd-580eba7df0f6]
aws_sns_topic_subscription.analytical_platform_compute_alerts_pagerduty: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-compute-alerts20230518155829593800000003:e88ff0ea-451a-438c-8d83-b334384ae799]
aws_sns_topic_subscription.control_panel_alerts_pagerduty: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:control-panel-alerts20230518155934196600000008:e42d2296-14fb-4c82-ae40-355d55a27853]
aws_sns_topic_subscription.analytical_platform_storage_alerts_pagerduty: Refreshing state... [id=arn:aws:sns:eu-west-1:525294151996:analytical-platform-storage-alerts20230518155829598600000005:5a92dd4f-cfec-4067-982f-9d85328232df]
aws_security_group.aps: Refreshing state... [id=sg-0b300e7b20e0a1b1d]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=development-aWrhyc0m]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eeacde33bf9d429d]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-070560316a18042a1]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-027026b1d29d193db]
module.control_panel_redis.module.aws_security_group.aws_security_group.cbd[0]: Refreshing state... [id=sg-0edcf8fdfc4d0af41]
aws_vpc_endpoint.aps: Refreshing state... [id=vpce-040879099251a594a]
module.rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-CNRX4KPRHN6XSU2QTTRKIGN6QI]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-01855512f559b02701080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e3c3e851f1aeb25a1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0d49afdc0c49bba9b1080289494]
module.control_panel_redis.module.aws_security_group.aws_security_group_rule.keyed["_allow_all_egress_"]: Refreshing state... [id=sgrule-2147854737]
module.control_panel_redis.aws_elasticache_replication_group.default[0]: Refreshing state... [id=development-control-panel-redis]
module.control_panel_redis.module.aws_security_group.aws_security_group_rule.keyed["in#in#sg#0"]: Refreshing state... [id=sgrule-3641140318]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008]
module.iam_assumable_role_ebs_csi_driver.data.aws_iam_policy_document.assume_role_with_oidc: Reading...
module.eks.data.http.wait_for_cluster[0]: Reading...
module.iam_assumable_role_external_secrets.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::525294151996:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/6F58D1C4FD8FAE6D3D9282A400EDCE79]
module.iam_assumable_role_jupyterhub_teama.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_ebs_csi_driver.data.aws_iam_policy_document.assume_role_with_oidc: Read complete after 0s [id=3035709493]
module.iam_assumable_role_control_panel_api.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_cert_manager.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_control_panel_api.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2556243230]
module.iam_assumable_role_external_secrets.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=4262065725]
module.iam_assumable_role_jupyterhub_teama.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1451106743]
module.iam_assumable_role_cert_manager.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2176431036]
module.iam_assumable_role_external_dns.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_control_panel_api.aws_iam_role.this[0]: Refreshing state... [id=dev_control_panel_api20230420142935268800000001]
module.iam_assumable_role_prometheus_remote_ingest.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_prometheus_remote_ingest.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=1171430757]
module.iam_assumable_role_jupyterhub_teama.aws_iam_role.this[0]: Refreshing state... [id=jupyterhub-teama]
module.iam_assumable_role_external_secrets.aws_iam_role.this[0]: Refreshing state... [id=external_secrets20211205095307655700000009]
module.iam_assumable_role_external_dns.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2696397177]
module.iam_assumable_role_prometheus_remote_ingest.aws_iam_role.this[0]: Refreshing state... [id=prometheus_remote_ingest]
module.iam_assumable_role_external_dns.aws_iam_role.this[0]: Refreshing state... [id=external_dns2021120509530766050000000b]
module.iam_assumable_role_cert_manager.aws_iam_role.this[0]: Refreshing state... [id=cert_manager2021120509530765700000000a]
module.karpenter.data.aws_iam_policy_document.irsa_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.irsa_assume_role[0]: Read complete after 0s [id=3795399257]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008-20211205095310523800000019]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008-2021120509531052870000001b]
module.eks.aws_iam_role_policy_attachment.workers_additional_policies[0]: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008-2021120509531053040000001c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008-2021120509531052500000001a]
module.iam_assumable_role_prometheus_remote_ingest.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=prometheus_remote_ingest-20230414161608277700000001]
module.iam_assumable_role_control_panel_api.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=dev_control_panel_api20230420142935268800000001-20230420142948750100000002]
aws_iam_role_policy_attachment.eks_worker_cloudwatch_agent: Refreshing state... [id=development-aWrhyc0m20211205095307648300000008-2021120509531064560000001d]
module.iam_assumable_role_jupyterhub_teama.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=jupyterhub-teama-20230414113610601600000001]
module.eks.module.node_groups.data.cloudinit_config.workers_userdata["main_node_pool"]: Reading...
module.eks.module.node_groups.data.cloudinit_config.workers_userdata["main_node_pool"]: Read complete after 0s [id=3507518246]
module.eks.module.node_groups.aws_launch_template.workers["main_node_pool"]: Refreshing state... [id=lt-0602d89e51e403c1f]
module.eks.data.http.wait_for_cluster[0]: Read complete after 0s [id=https://6F58D1C4FD8FAE6D3D9282A400EDCE79.gr7.eu-west-1.eks.amazonaws.com/healthz]
aws_iam_policy.cert_manager: Refreshing state... [id=arn:aws:iam::525294151996:policy/cert-manager20211205095308959200000011]
data.aws_iam_policy_document.cluster_autoscaler: Reading...
aws_eks_addon.coredns: Refreshing state... [id=development-aWrhyc0m:coredns]
data.aws_eks_cluster_auth.cluster: Reading...
module.iam_assumable_role_ebs_csi_driver.aws_iam_role.this: Refreshing state... [id=EbsCsiDriver20230220165045904000000002]
aws_eks_identity_provider_config.auth0: Refreshing state... [id=development-aWrhyc0m:Auth0]
aws_iam_policy.efs_csi_driver: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKSEFSCSIDriverPolicy20211205095308973400000012]
aws_eks_addon.kube_proxy: Refreshing state... [id=development-aWrhyc0m:kube-proxy]
data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=2252899642]
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=development-aWrhyc0m]
aws_iam_policy.external_secrets: Refreshing state... [id=arn:aws:iam::525294151996:policy/external_secrets2021120509530768180000000e]
aws_iam_policy.external_dns: Refreshing state... [id=arn:aws:iam::525294151996:policy/external_dns20211205095308997900000014]
aws_iam_policy.ebs_csi_driver: Refreshing state... [id=arn:aws:iam::525294151996:policy/EbsCsiDriver20230220165045735400000001]
data.aws_eks_cluster.cluster: Reading...
module.iam_assumable_role_cluster_autoscaler.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.iam_assumable_role_cluster_autoscaler.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=759293964]
aws_eks_addon.vpc_cni: Refreshing state... [id=development-aWrhyc0m:vpc-cni]
aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::525294151996:policy/cluster-autoscaler20211205095309001300000015]
aws_iam_policy_attachment.efs_csi_driver: Refreshing state... [id=AmazonEKSEFSCSIDriverRolePolicyAttachment]
module.iam_assumable_role_cluster_autoscaler.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-development-20211205095309048700000016]
module.eks.module.node_groups.aws_eks_node_group.workers["main_node_pool"]: Refreshing state... [id=development-aWrhyc0m:dev20211205095313387000000024]
module.iam_assumable_role_cert_manager.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cert_manager2021120509530765700000000a-20211205095311212700000021]
aws_eks_addon.ebs_csi_driver: Refreshing state... [id=development-aWrhyc0m:aws-ebs-csi-driver]
module.iam_assumable_role_external_dns.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=external_dns2021120509530766050000000b-20211205095311220400000022]
module.iam_assumable_role_ebs_csi_driver.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=EbsCsiDriver20230220165045904000000002-20230220165047226900000004]
module.iam_assumable_role_external_secrets.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=external_secrets20211205095307655700000009-20211205095311291100000023]
module.iam_assumable_role_cluster_autoscaler.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-autoscaler-development-20211205095309048700000016-20211205095311183300000020]
data.aws_eks_cluster.cluster: Read complete after 0s [id=development-aWrhyc0m]
kubernetes_namespace.airflow: Refreshing state... [id=airflow]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
kubernetes_service_account.airflow: Refreshing state... [id=airflow/airflow]
kubernetes_role.airflow: Refreshing state... [id=airflow/airflow]
kubernetes_role_binding.airflow: Refreshing state... [id=airflow/airflow]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_memory[0]: Refreshing state... [id=development-control-panel-redis-001-freeable-memory]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_memory[1]: Refreshing state... [id=development-control-panel-redis-002-freeable-memory]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_memory[2]: Refreshing state... [id=development-control-panel-redis-003-freeable-memory]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_cpu[2]: Refreshing state... [id=development-control-panel-redis-003-cpu-utilization]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_cpu[0]: Refreshing state... [id=development-control-panel-redis-001-cpu-utilization]
module.control_panel_redis.aws_cloudwatch_metric_alarm.cache_cpu[1]: Refreshing state... [id=development-control-panel-redis-002-cpu-utilization]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          - "mapAccounts" = jsonencode([])
          - "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::525294151996:role/development-aWrhyc0m20211205095307648300000008"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::525294151996:role/AWSReservedSSO_AdministratorAccess_675b01007c116a26"
                  "username": "restricted-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::525294151996:role/restricted-admin"
                  "username": "restricted-admin"
                - "groups":
                  - "system:masters"
                  - "system:bootstrappers"
                  "rolearn": "arn:aws:iam::525294151996:role/github-actions-privileged"
                  "username": "github-actions-infrastructure"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::042130406152:role/restricted-admin"
                  "username": "restricted-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::312423030077:role/restricted-admin"
                  "username": "restricted-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::525294151996:role/GlobalGitHubActionAdmin"
                  "username": "global-github-actions-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::312423030077:role/GlobalGitHubActionAdmin"
                  "username": "global-github-actions-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::042130406152:role/GlobalGitHubActionAdmin"
                  "username": "global-github-actions-admin"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::335889174965:role/data-platform-apps-and-tools-development-airflow-execution"
                  "username": "data-platform-apps-and-tools-development-airflow"
            EOT
          - "mapUsers"    = jsonencode([])
        } -> (known after apply)
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.karpenter.data.aws_iam_policy_document.irsa[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:CreateLaunchTemplate",
              + "ec2:CreateTags",
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstanceTypeOfferings",
              + "ec2:DescribeInstanceTypes",
              + "ec2:DescribeInstances",
              + "ec2:DescribeLaunchTemplates",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSpotPriceHistory",
              + "ec2:DescribeSubnets",
              + "pricing:GetProducts",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DeleteLaunchTemplate",
              + "ec2:TerminateInstances",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "development-aWrhyc0m",
                ]
              + variable = "ec2:ResourceTag/karpenter.sh/discovery"
            }
        }
      + statement {
          + actions   = [
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:525294151996:launch-template/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "development-aWrhyc0m",
                ]
              + variable = "ec2:ResourceTag/karpenter.sh/discovery"
            }
        }
      + statement {
          + actions   = [
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:525294151996:instance/*",
              + "arn:aws:ec2:*:525294151996:network-interface/*",
              + "arn:aws:ec2:*:525294151996:security-group/*",
              + "arn:aws:ec2:*:525294151996:spot-instances-request/*",
              + "arn:aws:ec2:*:525294151996:subnet/*",
              + "arn:aws:ec2:*:525294151996:volume/*",
              + "arn:aws:ec2:*::image/*",
              + "arn:aws:ec2:*::snapshot/*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:*:*:parameter/aws/service/*",
            ]
        }
      + statement {
          + actions   = [
              + "eks:DescribeCluster",
            ]
          + resources = [
              + "arn:aws:eks:*:525294151996:cluster/development-aWrhyc0m",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "SqsWrite"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                  + "sqs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - AWS health event"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = "KarpenterHealthEvent-"
      + tags           = {
          + "ClusterName" = "development-aWrhyc0m"
        }
      + tags_all       = {
          + "ClusterName"            = "development-aWrhyc0m"
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance rebalance recommendation"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance Rebalance Recommendation",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceRebalance-"
      + tags           = {
          + "ClusterName" = "development-aWrhyc0m"
        }
      + tags_all       = {
          + "ClusterName"            = "development-aWrhyc0m"
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance state-change notification"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceStateChange-"
      + tags           = {
          + "ClusterName" = "development-aWrhyc0m"
        }
      + tags_all       = {
          + "ClusterName"            = "development-aWrhyc0m"
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["spot_interupt"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 spot instance interruption warning"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = "KarpenterSpotInterrupt-"
      + tags           = {
          + "ClusterName" = "development-aWrhyc0m"
        }
      + tags_all       = {
          + "ClusterName"            = "development-aWrhyc0m"
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
    }

  # module.karpenter.aws_cloudwatch_event_target.this["health_event"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["spot_interupt"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "Karpenter-development-aWrhyc0m-"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = {
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
      + unique_id   = (known after apply)
    }

  # module.karpenter.aws_iam_policy.irsa[0] will be created
  + resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "Karpenter IAM role for service account"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "KarpenterIRSA-development-aWrhyc0m-"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
    }

  # module.karpenter.aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-west-1.amazonaws.com/id/6F58D1C4FD8FAE6D3D9282A400EDCE79:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-west-1.amazonaws.com/id/6F58D1C4FD8FAE6D3D9282A400EDCE79:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::525294151996:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/6F58D1C4FD8FAE6D3D9282A400EDCE79"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Karpenter IAM role for service account"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "KarpenterIRSA-development-aWrhyc0m-"
      + path                  = "/"
      + tags_all              = {
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
      + unique_id             = (known after apply)
    }

  # module.karpenter.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "Karpenter-development-aWrhyc0m-"
      + path                  = "/"
      + tags_all              = {
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
      + unique_id             = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "Karpenter-development-aWrhyc0m"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "application"            = "Analytical Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "tools"
          + "environment"            = "development"
          + "infrastructure-support" = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "analytical-platform:analytics-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/analytical-platform-infrastructure"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.karpenter.aws_sqs_queue_policy.this[0] will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 18 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ eks_config_map_aws_auth        = [
      ~ {
          ~ data        = {
              - mapAccounts = jsonencode([])
              - mapRoles    = <<-EOT
                    - "groups":
                      - "system:bootstrappers"
                      - "system:nodes"
                      "rolearn": "arn:aws:iam::525294151996:role/development-aWrhyc0m20211205095307648300000008"
                      "username": "system:node:{{EC2PrivateDNSName}}"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::525294151996:role/AWSReservedSSO_AdministratorAccess_675b01007c116a26"
                      "username": "restricted-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::525294151996:role/restricted-admin"
                      "username": "restricted-admin"
                    - "groups":
                      - "system:masters"
                      - "system:bootstrappers"
                      "rolearn": "arn:aws:iam::525294151996:role/github-actions-privileged"
                      "username": "github-actions-infrastructure"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::042130406152:role/restricted-admin"
                      "username": "restricted-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::312423030077:role/restricted-admin"
                      "username": "restricted-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::525294151996:role/GlobalGitHubActionAdmin"
                      "username": "global-github-actions-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::312423030077:role/GlobalGitHubActionAdmin"
                      "username": "global-github-actions-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::042130406152:role/GlobalGitHubActionAdmin"
                      "username": "global-github-actions-admin"
                    - "groups":
                      - "system:masters"
                      "rolearn": "arn:aws:iam::335889174965:role/data-platform-apps-and-tools-development-airflow-execution"
                      "username": "data-platform-apps-and-tools-development-airflow"
                EOT
              - mapUsers    = jsonencode([])
            } -> (known after apply)
            id          = "kube-system/aws-auth"
            # (3 unchanged attributes hidden)
        },
    ]
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Emterry, Action: `pull_request`, Working Directory: `terraform/aws/analytical-platform-development/cluster`, Workflow: `Terraform`*